
* Work

** Tasks

** Projects

*** TODO 程序化短课
    SCHEDULED: <2017-04-13 周四 19:00.+7d>

* Personal

** Tasks
*** DONE 整理期货程序化交易中需要注意的问题
    CLOSED: [2017-04-11 周二 13:41] SCHEDULED: <2017-04-11 周二 11:15>
    :PROPERTIES:
    :CREATED:  [2017-04-11 周二 11:12]
    :END:
    :LOGBOOK:
    CLOCK: [2017-04-11 周二 11:15]--[2017-04-11 周二 11:31] =>  0:16
    :END:
*** NEXT 心理线指标改进
    :PROPERTIES:
    :CREATED:  [2017-04-11 周二 13:40]
    :END:
    :LOGBOOK:
    CLOCK: [2017-04-15 周六 21:34]--[2017-04-15 周六 22:00] =>  0:26
    CLOCK: [2017-04-13 周四 10:20]--[2017-04-13 周四 10:45] =>  0:25
    CLOCK: [2017-04-13 周四 09:38]--[2017-04-13 周四 10:03] =>  0:25
    CLOCK: [2017-04-12 周三 13:34]--[2017-04-12 周三 14:30] =>  0:56
    CLOCK: [2017-04-11 周二 23:21]--[2017-04-11 周二 23:46] =>  0:25
    CLOCK: [2017-04-11 周二 22:56]--[2017-04-11 周二 23:21] =>  0:25
    CLOCK: [2017-04-11 周二 15:26]--[2017-04-11 周二 15:48] =>  0:22
    CLOCK: [2017-04-11 周二 13:43]--[2017-04-11 周二 15:16] =>  1:33
    CLOCK: [2017-04-11 周二 13:40]--[2017-04-11 周二 13:41] =>  0:01
    :END:
*** NEXT 布林通道策略改进
    :PROPERTIES:
    :CREATED:  [2017-04-11 周二 15:49]
    :END:
    :LOGBOOK:
    CLOCK: [2017-04-11 周二 15:49]--[2017-04-11 周二 15:58] =>  0:09
    :END:
*** DONE 下载 Youtube 上对应 Python 视频
    CLOSED: [2017-04-13 周四 14:54]
    :PROPERTIES:
    :CREATED:  [2017-04-12 周三 15:12]
    :END:
** Projects

*** TODO Scikit-learn 学习计划 [0%]
    SCHEDULED: <2017-04-11 周二 19:00.+1d>
    
    - [ ] Supervised Learning
      - [ ] Generalized Linear Models
      - [ ] Linear and Quadratic Discriminant Analysis
      - [ ] Kernel Ridge Regression
      - [ ] Support Vector Machines
      - [ ] Stochastic Gradient Descent
      - [ ] Nearest Neighbors
      - [ ] Gaussian Processes
      - [ ] Cross Decomposition
      - [ ] Naive Bayes
      - [ ] Decision Tress
      - [ ] Ensemble Methods
      - [ ] Multi-class And Multi-label Algorithm
      - [ ] Feature Selection
      - [ ] Semi-Supervised
      - [ ] Isotonic Regression
      - [ ] Probability Calibration
      - [ ] Neural Network Models (supervised)
    - [ ] Unsupervised Learning
      - [ ] Gaussian Mixture Models
      - [ ] Manifold Learning
      - [ ] Clustering
      - [ ] Bi-clustering
      - [ ] Decomposing Signals in Components (matrix factorization problems)
      - [ ] Covariance Estimation
      - [ ] Novelty and Outlier Detection
      - [ ] Density Estimation
      - [ ] Neural Network Models (unsupervised)
    - [ ] Model Selection And Evaluation
      - [ ] Cross-validation: Evaluating Estimator Performance
      - [ ] Tuning The Hyper-parameters of An Estimator
      - [ ] Model Evaluation: Quantifying the Quality of Predictions
      - [ ] Model Persistence
      - [ ] Validation Curves: Plotting Scores to Evaluate Models
    - [ ] Dataset Transformations
      - [ ] Pipeline and Feature Union: Combining Estimators
      - [ ] Feature Extraction
      - [ ] Preprocessing Data
      - [ ] Random Projection
      - [ ] Kernel Approximation
      - [ ] Pairwise Metrics, Affinities and Kernels
      - [ ] Transforming The Predictor Target (y)
    - [ ] Dataset Loading Utilities
      - [ ] General Dataset API
      - [ ] Toy Dataset
      - [ ] Sample Images
      - [ ] Sample Generators
      - [ ] Datasets in =svmlight= / =libsvm=  Format
      - [ ] Loading From External Datasets
      - [ ] The Olivetti Faces Dataset
      - [ ] The 20 Newsgroups Text Dataset
      - [ ] Downloading Datasets From the =mldata.org= repository
      - [ ] The Labeled Faces in The Wild Face Recognition Dataset
      - [ ] Forest Cover Types
      - [ ] =RCV1= Dataset
      - [ ] Boston House Prices Dataset
      - [ ] Breast Cancer Wisconsin (Dignostic) Dataset
      - [ ] Diabetes Dataset
      - [ ] Optical Recognition of Handwritten Digits Data Set
      - [ ] Iris Plants Database
      - [ ] Linnerrud Dataset
    - [ ] Strategies to scale computationally: bigger data
      - [ ] Scaling with Instances Using Out-of-core Learning
    - [ ] Computational Performance
      - [ ] Prediction Latency
      - [ ] Prediction Throughput
      - [ ] Tips And Tricks

*** NEXT vnpy 学习计划
    :LOGBOOK:
    CLOCK: [2017-04-13 周四 14:54]--[2017-04-13 周四 15:04] =>  0:10
    CLOCK: [2017-04-11 周二 16:36]--[2017-04-11 周二 17:01] =>  0:25
    :END:
    
* Miscellaneous

** Habit

*** 吾日三省吾身 
    SCHEDULED: <2017-04-11 周二 22:30.+1d>

*** 健身
    SCHEDULED: <2017-04-11 周二 20:00.+1d>

*** 周三组会
    SCHEDULED: <2017-04-12 周三 10:00.+7d>

** Finance

*** 房租
  
**** 2017/01

     + 押金： -13200.00
     + 电费： -141.44
     + 首月租金： -6600.00
     + 水费： -33.00
     + 网费： -2379.00
     + 保安介绍费： -1200.00
     + 总额： -23553.44
     + 王雄已缴：20000.00
     + 胡琛已缴：2412.00
     + 李翔已缴：5734.44
     + 王雄结转：9748.85
       20000.00 - 9000.00 (首月租金加押金) - 47.15 (电费) - 11.00 (纯净水) - 793.00 (网费) - 400.00 (保安介绍费) = 9748.85
     + 李翔结转： -316.71 
       5734.44 - 4800 (首月押金加租金) - 47.15 (电费) - 11.00 (纯净水) - 793.00 (网费) - 400 (保安介绍费) = -316.71

**** 2017/02

     + 房租： -6600.00
     + 王雄房门开锁换锁： -160.00
     + 1 月网费： -200.00 (1 月网费是单独计费)
     + 王雄结转：9748.85 - 3000.00(房租) - 67.00(网费) - 160.00(房锁) = 6521.85
     + 李翔结转： -316.71 - 67.00(网费) = -383.71

**** 2017/03
       
     + 房租： -6600.00
     + 物业管理费：789.00
     + 电费：76.84
     + 王雄结转：6521.85 - 3000.00(房租) - 263.00(物业) - 25.61(电费) = 3233.24 
     + 李翔结转：0.00 - 25.61(电费) = -25.61

**** 2017/04
     
     + 房租： -6600.00
     + 王雄结转：3233.24 - 3000(房租) = 233.24
     + 李翔结转：0.00
       

*** 出书经费 

    + 总额：12000
    + 2016 年 12 月工资： -3000.00
    + 2017 年 1 月工资： -3000.00
    + 2017 年 2 月工资： -3000.00
    + 其他支出：
      - 牛奶： -100.00 (黄镇海)
      - 咖啡： -200.00 (甄赏)
      - 吃饭： -500.00 (胡琛)
      - 交通： -200.00 (胡琛)
    + 结余：2000.00
